sex('Алсина фон /Брауншвейг-Грубенхаген/','F').
sex('Жан де /Бриенн/','M').
sex('Иоланда (Изабелла II) де /Бриенн/','F').
sex('Хелвиза де /Дампьер/','F').
sex('Ютта /Саксонская/','F').
sex('Феодора /Комнин/','F').
sex('N /Комнин/','U').
sex('Мейнхард III /Тирольский/','M').
sex('Хелвиза фон /Брауншвейг-Грубенхаген/','F').
sex('Елизавета /Мейсенская/','F').
sex('Анна /Гогенцоллерн-Нюрнбергская/','F').
sex('София /Датская/','F').
sex('Филипп /Аквилейский/','M').
sex('Агнесса /Австрийская/','F').
sex('Гуго IV де/Лузиньян/','M').
sex('Амори де /Бриенн/','M').
sex('Елизавета фон /Гогенцоллерн/','F').
sex('Елизавета /Гессенская/','F').
sex('Мария /Комнин/','F').
sex('Конрад IV /Германский/','M').
sex('Эрард де /Бриенн/','M').
sex('Иоанн фон /Брауншвейг-Грубенхаген/','M').
sex('Елизавета фон /Голштейн-Плен/','F').
sex('Ирина /Манассус/','F').
sex('Готье VI де /Бриенн/','M').
sex('Маргарита (Малгоржата) /Померанская/','F').
sex('Мария Иоланта /Монферратская/','F').
sex('Маргарита /Гогенцоллерн-Нюрнбергская/','F').
sex('Фридрих III /Австрийский/','M').
sex('Оттон /Брауншвейг-Остероде/','M').
sex('Фридрих Хромой /Мейсенский/','M').
sex('Генрих /Гогенштауфен/','M').
sex('Эрард де /Бриенн/','M').
sex('Петр I де/Лузиньян/','M').
sex('Матильда фон /Брауншвейг-Грубенхаген/','F').
sex('Мария де /Лузиньян/','F').
sex('Оттон фон /Брауншвейг-Грубенхаген/','M').
sex('Елизавета /Мейсенская/','F').
sex('Леопольд /Австрийский/','M').
sex('София /Мекленбург-Верле/','F').
sex('Фридрих I /Австрийский/','M').
sex('Альбрехт фон /Брауншвейг-Геттинген/','M').
sex('Алексей /Комнин/','M').
sex('Фридрих /Мейсенский/','M').
sex('Мельхиор фон /Брауншвейг-Грубенхаген/','M').
sex('Агнесса /Чешская/','F').
sex('Жан де /Лузиньян/','M').
sex('Жанна де /Бриенн/','F').
sex('Беатриса /Гогенцоллерн-Нюрнбергская/','F').
sex('Дитрих IV /Мейсенский/','M').
sex('Гюи де /Конфлан/','M').
sex('Генрих дез /Плейззенлендес/','M').
sex('Цабель /Армянская/','F').
sex('Людвиг фон /Брауншвейг-Грубенхаген/','M').
sex('Фридрих II /Австрийский/','M').
sex('Генрих де /Бриенн/','M').
sex('Агнесса фон /Брауншвейг-Остероде/','F').
sex('Альбрехт /Брауншвейг-Грубенхаген/','M').
sex('Изабелла де /Лузиньян/','F').
sex('Гертруда /Мейсенская/','F').
sex('Агнесса /Мейсенская/','F').
sex('Богуслав VI /Померанский/','M').
sex('Бернхард /Каринтийский/','M').
sex('Эрард де /Нантье-ла-Фоссе/','M').
sex('Маргарита /Австрийская/','F').
sex('Бернхард II /Каринтийский/','M').
sex('Маргарита де /Грандпре/','F').
sex('Матильда фон /Мекленбург-Верле/','F').
sex('Феодора /Комнин/','F').
sex('Леопольд V /Австрийский/','M').
sex('Стефан /Комнин/','M').
sex('Адельгейда фон /Брауншвейг-Грубенхаген/','F').
sex('Гюи де /Лузиньян/','M').
sex('Эрнст II фон /Брауншвейг-Геттинген/','M').
sex('Фридрих Одноземельный дез /Плейззенлендес/','M').
sex('Фридрих /Гогенштауфен/','M').
sex('Герман /Баварский/','M').
sex('Мария де /Лузиньян/','F').
sex('Ингеборга фон /Голштейн-Сегеберг/','F').
sex('Иоанн фон /Брауншвейг-Грубенхаген/','M').
sex('Альбрехт II Негодный/Мейсенский/','M').
sex('Изабелла де /Грандпре/','F').
sex('Генрих II фон /Брауншвейг-Грубенхаген/','M').
sex('Герхард IV фон /Голштейн-Сегеберг/','M').
sex('Гуго III де/Лузиньян/','M').
sex('Фридрих I Воинственный /Саксонский/','M').
sex('Готье V де/Бриенн/','M').
sex('Анна /Мейсенская/','M').
sex('Леопольд VI /Австрийский/','M').
sex('Елизавета фон /Брауншвейг-Геттинген/','F').
sex('Рикса фон /Брауншвейг-Геттинген/','F').
sex('Маргарита фон /Брауншвейг-Грубенхаген/','F').
sex('Константин /Ласкарис/','M').
sex('Бернхард II фон /Мекленбург-Верле/','M').
sex('Ингеборга /Шведская/','F').
sex('Фридрих I (VI) /Бранденбургский/','M').
sex('Иоанн II фон /Брауншвейг-Остероде/','M').
sex('Казимир III /Померанский/','M').
sex('Беатриса де /Рамерун/','F').
sex('Фридрих III Сильный /Мейсенский/','M').
sex('Фридрих /Мейсенский/','M').
sex('Агнесса фон /Брауншвейг-Геттинген/','F').
sex('Алексей /Комнин/','M').
sex('Готье де /Нантье-ла-Фоссе/','M').
sex('Изабелла де /Бриенн/','F').
sex('Беатриса /Мейсенская/','F').
sex('Вильгельм I Одноглазый /Мейсенский/','M').
sex('Святобор I /Померанский/','M').
sex('Адельгейда (Ирина) фон /Брауншвейг-Грубенхаген/','F').
sex('Альбрехт II /Брауншвейг-Зальцдерхелден/','M').
sex('Генрих /Каринтийский/','M').
sex('Фридрих Миролюбивый /Тюрингский/','M').
sex('Георг /Мейсенский/','M').
sex('София /Мейсенская/','F').
sex('Эрнст I фон /Брауншвейг-Остероде/','M').
sex('Эльжбетта (Рикса) /Польская/','F').
sex('Матильда /Померанская/','F').
sex('Генрих /Австрийский/','M').
sex('Эрнст фон /Брауншвейг-Герцберг/','M').
sex('Гертруда /Австрийская/','F').
sex('Томас фон /Брауншвейг-Грубенхаген/','M').
sex('Дицман /Мейсенский/','M').
sex('Фридрих /Брауншвейг-Грубенхаген/','M').
sex('Ютта /Гессенская/','F').
sex('Елизавета /Мейсенская/','F').
sex('Вартислав VI /Померанский/','M').
sex('Жак I де /Лузиньян/','M').
sex('Констанция /Австрийская/','F').
sex('Хелвиза фон /Брауншвейг-Грубенхаген/','F').
sex('Генрих /Австрийский/','M').
sex('Фридрих II Серьезный /Мейсенский/','M').
sex('Агнесса фон /Брауншвейг-Грубенхаген/','F').
sex('Фасия фон /Брауншвейг-Грубенхаген/','F').
sex('Фридрих Тута /Мейсенский/','M').
sex('Оттон /Брауншвейг-Грубенхаген/','M').
sex('Агнесса фон /Брауншвейг-Грубенхаген/','F').
sex('Готье де /Бриенн/','M').
sex('Ингеборга /Датская/','F').
sex('Маргарита Маульташ /Каринтийская/','F').
sex('Оттон /Гессенский/','M').
sex('Генрих де /Грандпре/','M').
sex('Гуго де /Лузиньян/','M').
sex('Барним III Великий /Померанский/','M').
sex('Иоанн III /Гогенцоллерн-Нюрнбергский/','M').
sex('Мария де /Бриенн/','F').
sex('Изабелла де /Бриенн/','F').
sex('Вартислав VII /Померанский/','M').
sex('Филипп фон /Брауншвейг-Грубенхаген/','M').
sex('Филиппа /Армянская/','F').
sex('Фридрих I /Мейсенский/','M').
sex('Елизавета фон /Брауншвейг-Остероде/','F').
sex('Маргарита /Мейсенская/','F').
sex('Маргарита /Гессенская/','F').
sex('Рикса /Шведская/','F').
sex('Гюи де /Лузиньян/','M').
sex('Евдокия /Комнин/','F').
sex('Анна фон /Брауншвейг-Остероде/','F').
sex('Аделаида (Адельгейда) /Гессенская/','F').
sex('Агнесса /Гогенцоллерн-Нюрнбергская/','F').
sex('Елизавета /Мейсенская/','F').
sex('Генрих де /Бриенн/','M').
sex('Клара /Мейсенская/','F').
sex('Генрих I де/Лузиньян/','M').
sex('Адела (Алиса) /Шампанская/','F').
sex('Вильгельм II Богатый /Мейсенский/','M').
sex('Вильгельм фон /Брауншвейг-Остероде/','M').
sex('Эрик I фон /Брауншвейг-Грубенхаген/','M').
sex('Богуслав VII /Померанский/','M').
sex('Гуго II де/Лузиньян/','M').
sex('Алексей /Комнин/','M').
sex('Адельгейда фон /Брауншвейг-Геттинген/','F').
sex('Фридрих фон /Брауншвейг-Остероде/','M').
sex('Балтазар фон /Брауншвейг-Грубенхаген/','M').
sex('Оттон I фон /Брауншвейг-Геттинген/','M').
sex('Оттон /Померанский/','M').
sex('Маргарита /Каринтийская/','F').
sex('Ульрих III /Каринтийский/','M').
sex('Сибилла де /Лузиньян/','F').
sex('Людвиг /Мейсенский/','M').
sex('Риддаг фон /Брауншвейг-Грубенхаген/','M').
sex('Конрадин (Конрад V) /Швабский/','M').
sex('Жанна де /Бриенн/','F').
sex('Агнесса /Баденская/','F').
sex('Иоанн /Брауншвейг-Грубенхаген/','M').
sex('Анна /Мейсенская/','F').
sex('Анна фон /Брауншвейг-Остероде/','F').
sex('Маргарита де /Лузиньян/','F').
sex('Мария /Шампанская/','F').
sex('Изабелла де /Лузиньян/','F').
sex('Жан де /Грандпре/','M').
sex('Екатерина /Гогенцоллерн-Нюрнбергская/','F').
sex('Маргарита де /Бриенн/','F').
sex('Мария /Комнин/','F').
sex('Гертруда /Австрийская/','F').
sex('Конрад /Брауншвейг-Грубенхаген/','M').
sex('Агнесса /Австрийская/','F').
sex('Ричардис фон /Брауншвейг-Грубенхаген/','F').
sex('Гуго де /Бриенн/','M').
sex('N /Мейсенский/','M').
sex('Изабелла /Иерусалимская/','F').
sex('Иоанн /Комнин/','M').
sex('Балтазар /Тюрингский/','M').
sex('Филиппа /Шампанская/','F').
sex('Альбрехт /Мейсенский/','M').
sex('Елизавета /Померанская/','F').
sex('Барним V /Померанский/','M').
sex('Оттон II фон /Брауншвейг-Остероде/','M').
sex('Ульрих II /Каринтийский/','M').
sex('Богуслав VIII /Померанский/','M').
sex('Бернхард /Саксонский/','M').
sex('Генрих /Австрийский/','M').

parent('Иоланда (Изабелла II) де /Бриенн/','Конрад IV /Германский/').
parent('Хелвиза де /Дампьер/','Иоанн /Брауншвейг-Грубенхаген/').
parent('Ютта /Саксонская/','Ингеборга /Датская/').
parent('Ютта /Саксонская/','София /Датская/').
parent('Феодора /Комнин/','Агнесса /Австрийская/').
parent('Феодора /Комнин/','Леопольд V /Австрийский/').
parent('Феодора /Комнин/','Генрих /Австрийский/').
parent('Феодора /Комнин/','Алексей /Комнин/').
parent('Хелвиза фон /Брауншвейг-Грубенхаген/','Янус I де /Лузиньян/').
parent('Хелвиза фон /Брауншвейг-Грубенхаген/','Изабелла де /Лузиньян/').
parent('София /Датская/','Ингеборга /Шведская/').
parent('София /Датская/','Рикса /Шведская/').
parent('Агнесса /Австрийская/','Ютта /Саксонская/').
parent('Агнесса /Австрийская/','Бернхард /Саксонский/').
parent('Гуго IV де/Лузиньян/','Гуго де /Лузиньян/').
parent('Гуго IV де/Лузиньян/','Гюи де /Лузиньян/').
parent('Гуго IV де/Лузиньян/','Петр I де/Лузиньян/').
parent('Гуго IV де/Лузиньян/','Жак I де /Лузиньян/').
parent('Гуго IV де/Лузиньян/','Жан де /Лузиньян/').
parent('Елизавета фон /Гогенцоллерн/','Людвиг III Бородатый /Пфальцский/').
parent('Елизавета фон /Гогенцоллерн/','Маргарита /Пфальцская/').
parent('Елизавета фон /Гогенцоллерн/','Агнесса /Пфальцская/').
parent('Елизавета фон /Гогенцоллерн/','Елизавета /Пфальцская/').
parent('Елизавета фон /Гогенцоллерн/','Иоанн /Пфальц-Нейбургский/').
parent('Елизавета фон /Гогенцоллерн/','Стефан /Пфальц-Цвейбрюкенский/').
parent('Елизавета фон /Гогенцоллерн/','Оттон I /Пфальц-Мосбахский/').
parent('Елизавета /Гессенская/','Оттон I фон /Брауншвейг-Геттинген/').
parent('Елизавета /Гессенская/','Эрнст II фон /Брауншвейг-Геттинген/').
parent('Елизавета /Гессенская/','Альбрехт фон /Брауншвейг-Геттинген/').
parent('Елизавета /Гессенская/','Адельгейда фон /Брауншвейг-Геттинген/').
parent('Елизавета /Гессенская/','Рикса фон /Брауншвейг-Геттинген/').
parent('Елизавета /Гессенская/','Агнесса фон /Брауншвейг-Геттинген/').
parent('Елизавета /Гессенская/','Елизавета фон /Брауншвейг-Геттинген/').
parent('Конрад IV /Германский/','Конрадин (Конрад V) /Швабский/').
parent('Елизавета фон /Голштейн-Плен/','Барним III Великий /Померанский/').
parent('Елизавета фон /Голштейн-Плен/','Матильда /Померанская/').
parent('Ирина /Манассус/','Иоанн /Комнин/').
parent('Ирина /Манассус/','Алексей /Комнин/').
parent('Ирина /Манассус/','Мария /Комнин/').
parent('Ирина /Манассус/','Феодора /Комнин/').
parent('Ирина /Манассус/','Евдокия /Комнин/').
parent('Готье VI де /Бриенн/','Готье де /Бриенн/').
parent('Готье VI де /Бриенн/','Жанна де /Бриенн/').
parent('Готье VI де /Бриенн/','Маргарита де /Бриенн/').
parent('Мария Иоланта /Монферратская/','Иоланда (Изабелла II) де /Бриенн/').
parent('Маргарита /Гогенцоллерн-Нюрнбергская/','Маргарита /Гессенская/').
parent('Маргарита /Гогенцоллерн-Нюрнбергская/','Агнесса /Гессенская/').
parent('Маргарита /Гогенцоллерн-Нюрнбергская/','Людвиг I /Гессенский/').
parent('Петр I де/Лузиньян/','Петр II де/Лузиньян/').
parent('Матильда фон /Брауншвейг-Грубенхаген/','София /Мекленбург-Верле/').
parent('Матильда фон /Брауншвейг-Грубенхаген/','Бернхард II фон /Мекленбург-Верле/').
parent('София /Мекленбург-Верле/','Вартислав VI /Померанский/').
parent('София /Мекленбург-Верле/','Елизавета /Померанская/').
parent('София /Мекленбург-Верле/','Богуслав VI /Померанский/').
parent('Жан де /Лузиньян/','Петр де /Лузиньян-Триполийский/').
parent('Беатриса /Гогенцоллерн-Нюрнбергская/','Альбрехт IV Терпеливый/Австрийский/').
parent('Дитрих IV /Мейсенский/','София /Мейсенская/').
parent('Дитрих IV /Мейсенский/','Фридрих Тута /Мейсенский/').
parent('Дитрих IV /Мейсенский/','Гертруда /Мейсенская/').
parent('Генрих дез /Плейззенлендес/','Фридрих Одноземельный дез /Плейззенлендес/').
parent('Генрих де /Бриенн/','Эрард де /Бриенн/').
parent('Генрих де /Бриенн/','Генрих де /Бриенн/').
parent('Генрих де /Бриенн/','Беатриса де /Рамерун/').
parent('Изабелла де /Лузиньян/','Хелвиза де /Дампьер/').
parent('Агнесса /Мейсенская/','Алсина фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Оттон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Альбрехт /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Адельгейда фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Фасия фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Агнесса фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Генрих II фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Фридрих /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Конрад /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Матильда фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Эрнст I фон /Брауншвейг-Остероде/').
parent('Агнесса /Мейсенская/','Вильгельм фон /Брауншвейг-Остероде/').
parent('Агнесса /Мейсенская/','Иоанн фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Адельгейда (Ирина) фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Ричардис фон /Брауншвейг-Грубенхаген/').
parent('Агнесса /Мейсенская/','Маргарита фон /Брауншвейг-Грубенхаген/').
parent('Богуслав VI /Померанский/','Агнесса /Померанская/').
parent('Богуслав VI /Померанский/','София /Померанская/').
parent('Маргарита /Австрийская/','Генрих /Гогенштауфен/').
parent('Маргарита /Австрийская/','Фридрих /Гогенштауфен/').
parent('Бернхард II /Каринтийский/','Филипп /Аквилейский/').
parent('Бернхард II /Каринтийский/','Маргарита /Каринтийская/').
parent('Бернхард II /Каринтийский/','Бернхард /Каринтийский/').
parent('Бернхард II /Каринтийский/','Ульрих III /Каринтийский/').
parent('Леопольд V /Австрийский/','Леопольд VI /Австрийский/').
parent('Леопольд V /Австрийский/','Фридрих I /Австрийский/').
parent('Адельгейда фон /Брауншвейг-Грубенхаген/','Маргарита Маульташ /Каринтийская/').
parent('Мария де /Лузиньян/','Жан де /Бриенн/').
parent('Мария де /Лузиньян/','Гуго де /Бриенн/').
parent('Мария де /Лузиньян/','Амори де /Бриенн/').
parent('Ингеборга фон /Голштейн-Сегеберг/','Конрад II фон /Ольденбург-Ольденбург/').
parent('Ингеборга фон /Голштейн-Сегеберг/','Герхард фон /Ольденбург-Ольденбург/').
parent('Ингеборга фон /Голштейн-Сегеберг/','Христиан VII фон /Ольденбург-Вельсбург/').
parent('Ингеборга фон /Голштейн-Сегеберг/','Агнесса фон /Ольденбург-Ольденбург/').
parent('Альбрехт II Негодный/Мейсенский/','Генрих дез /Плейззенлендес/').
parent('Альбрехт II Негодный/Мейсенский/','Фридрих I /Мейсенский/').
parent('Альбрехт II Негодный/Мейсенский/','Дицман /Мейсенский/').
parent('Альбрехт II Негодный/Мейсенский/','Маргарита /Мейсенская/').
parent('Альбрехт II Негодный/Мейсенский/','Агнесса /Мейсенская/').
parent('Альбрехт II Негодный/Мейсенский/','Альбрехт /Мейсенский/').
parent('Альбрехт II Негодный/Мейсенский/','Елизавета /Мейсенская/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Агнесса фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Оттон фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Иоанн фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Людвиг фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Филипп фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Балтазар фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Томас фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Мельхиор фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Риддаг фон /Брауншвейг-Грубенхаген/').
parent('Генрих II фон /Брауншвейг-Грубенхаген/','Хелвиза фон /Брауншвейг-Грубенхаген/').
parent('Герхард IV фон /Голштейн-Сегеберг/','Ингеборга фон /Голштейн-Сегеберг/').
parent('Гуго III де/Лузиньян/','Мария де /Лузиньян/').
parent('Гуго III де/Лузиньян/','Маргарита де /Лузиньян/').
parent('Гуго III де/Лузиньян/','Гюи де /Лузиньян/').
parent('Фридрих I Воинственный /Саксонский/','Екатерина /Саксонская/').
parent('Фридрих I Воинственный /Саксонский/','Фридрих II Добродушный /Саксонский/').
parent('Фридрих I Воинственный /Саксонский/','Сигизмунд /Саксонский/').
parent('Фридрих I Воинственный /Саксонский/','Анна /Саксонская/').
parent('Фридрих I Воинственный /Саксонский/','Екатерина /Саксонская/').
parent('Фридрих I Воинственный /Саксонский/','Генрих /Саксонский/').
parent('Фридрих I Воинственный /Саксонский/','Вильгельм III Смелый /Тюрингский/').
parent('Готье V де/Бриенн/','Готье VI де /Бриенн/').
parent('Готье V де/Бриенн/','Изабелла де /Бриенн/').
parent('Леопольд VI /Австрийский/','Маргарита /Австрийская/').
parent('Леопольд VI /Австрийский/','Агнесса /Австрийская/').
parent('Леопольд VI /Австрийский/','Леопольд /Австрийский/').
parent('Леопольд VI /Австрийский/','Генрих /Австрийский/').
parent('Леопольд VI /Австрийский/','Фридрих II /Австрийский/').
parent('Леопольд VI /Австрийский/','Констанция /Австрийская/').
parent('Леопольд VI /Австрийский/','Гертруда /Австрийская/').
parent('Бернхард II фон /Мекленбург-Верле/','Матильда фон /Мекленбург-Верле/').
parent('Ингеборга /Шведская/','Герхард IV фон /Голштейн-Сегеберг/').
parent('Ингеборга /Шведская/','Елизавета фон /Голштейн-Плен/').
parent('Фридрих I (VI) /Бранденбургский/','Елизавета /Бранденбургская/').
parent('Фридрих I (VI) /Бранденбургский/','Иоанн III Алхимик/Бранденбургский/').
parent('Фридрих I (VI) /Бранденбургский/','Цецилия /Бранденбургская/').
parent('Фридрих I (VI) /Бранденбургский/','Маргарита /Бранденбургская/').
parent('Фридрих I (VI) /Бранденбургский/','Магдалена /Бранденбургская/').
parent('Фридрих I (VI) /Бранденбургский/','Фридрих II Железный Зуб /Бранденбургский/').
parent('Фридрих I (VI) /Бранденбургский/','Альбрехт III Ахиллес /Бранденбургский/').
parent('Фридрих I (VI) /Бранденбургский/','Доротея /Бранденбургская/').
parent('Фридрих I (VI) /Бранденбургский/','Фридрих III Младший /Бранденбургский/').
parent('Фридрих III Сильный /Мейсенский/','Фридрих /Мейсенский/').
parent('Фридрих III Сильный /Мейсенский/','Фридрих I Воинственный /Саксонский/').
parent('Фридрих III Сильный /Мейсенский/','Вильгельм II Богатый /Мейсенский/').
parent('Фридрих III Сильный /Мейсенский/','Георг /Мейсенский/').
parent('Агнесса фон /Брауншвейг-Геттинген/','Елизавета фон /Цигенхейн/').
parent('Агнесса фон /Брауншвейг-Геттинген/','Агнесса фон /Цигенхейн/').
parent('Изабелла де /Бриенн/','Генрих де /Грандпре/').
parent('Изабелла де /Бриенн/','Жан де /Грандпре/').
parent('Изабелла де /Бриенн/','Изабелла де /Грандпре/').
parent('Изабелла де /Бриенн/','Маргарита де /Грандпре/').
parent('Святобор I /Померанский/','Маргарита /Померанская/').
parent('Святобор I /Померанский/','Оттон II /Померанский/').
parent('Святобор I /Померанский/','Альбрехт /Померанский/').
parent('Святобор I /Померанский/','Казимир V /Померанский/').
parent('Альбрехт II /Брауншвейг-Зальцдерхелден/','Эрик I фон /Брауншвейг-Грубенхаген/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Оттон /Брауншвейг-Остероде/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Альбрехт II /Брауншвейг-Зальцдерхелден/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Иоанн II фон /Брауншвейг-Остероде/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Елизавета фон /Брауншвейг-Остероде/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Агнесса фон /Брауншвейг-Остероде/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Анна фон /Брауншвейг-Остероде/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Эрнст фон /Брауншвейг-Герцберг/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Фридрих фон /Брауншвейг-Остероде/').
parent('Эрнст I фон /Брауншвейг-Остероде/','Анна фон /Брауншвейг-Остероде/').
parent('Эльжбетта (Рикса) /Польская/','Агнесса /Чешская/').
parent('Генрих /Австрийский/','Гертруда /Австрийская/').
parent('Елизавета /Мейсенская/','Оттон /Гессенский/').
parent('Елизавета /Мейсенская/','Аделаида (Адельгейда) /Гессенская/').
parent('Елизавета /Мейсенская/','Елизавета /Гессенская/').
parent('Елизавета /Мейсенская/','Ютта /Гессенская/').
parent('Елизавета /Мейсенская/','Маргарита /Гессенская/').
parent('Вартислав VI /Померанский/','Барним VI /Померанский/').
parent('Вартислав VI /Померанский/','София /Померанская/').
parent('Вартислав VI /Померанский/','Вартислав VIII /Померанский/').
parent('Вартислав VI /Померанский/','Анна /Померанская/').
parent('Жак I де /Лузиньян/','Янус I де /Лузиньян/').
parent('Жак I де /Лузиньян/','Изабелла де /Лузиньян/').
parent('Констанция /Австрийская/','Альбрехт II Негодный/Мейсенский/').
parent('Констанция /Австрийская/','Дитрих IV /Мейсенский/').
parent('Фридрих II Серьезный /Мейсенский/','Елизавета /Мейсенская/').
parent('Фридрих II Серьезный /Мейсенский/','Фридрих /Мейсенский/').
parent('Фридрих II Серьезный /Мейсенский/','Фридрих III Сильный /Мейсенский/').
parent('Фридрих II Серьезный /Мейсенский/','Балтазар /Тюрингский/').
parent('Фридрих II Серьезный /Мейсенский/','Беатриса /Мейсенская/').
parent('Фридрих II Серьезный /Мейсенский/','Людвиг /Мейсенский/').
parent('Фридрих II Серьезный /Мейсенский/','Вильгельм I Одноглазый /Мейсенский/').
parent('Фридрих II Серьезный /Мейсенский/','Анна /Мейсенская/').
parent('Фридрих II Серьезный /Мейсенский/','Клара /Мейсенская/').
parent('Фридрих Тута /Мейсенский/','N /Мейсенский/').
parent('Фридрих Тута /Мейсенский/','Елизавета /Мейсенская/').
parent('Агнесса фон /Брауншвейг-Грубенхаген/','Оттон /Померанский/').
parent('Агнесса фон /Брауншвейг-Грубенхаген/','Казимир III /Померанский/').
parent('Агнесса фон /Брауншвейг-Грубенхаген/','Святобор I /Померанский/').
parent('Агнесса фон /Брауншвейг-Грубенхаген/','Богуслав VII /Померанский/').
parent('Маргарита Маульташ /Каринтийская/','Герман /Баварский/').
parent('Маргарита Маульташ /Каринтийская/','Мейнхард III /Тирольский/').
parent('Барним III Великий /Померанский/','Оттон /Померанский/').
parent('Барним III Великий /Померанский/','Казимир III /Померанский/').
parent('Барним III Великий /Померанский/','Святобор I /Померанский/').
parent('Барним III Великий /Померанский/','Богуслав VII /Померанский/').
parent('Иоанн III /Гогенцоллерн-Нюрнбергский/','Елизавета /Гогенцоллерн-Нюрнбергская/').
parent('Мария де /Бриенн/','Эрард де /Нантье-ла-Фоссе/').
parent('Мария де /Бриенн/','Готье де /Нантье-ла-Фоссе/').
parent('Мария де /Бриенн/','Гюи де /Конфлан/').
parent('Вартислав VII /Померанский/','Эрик I /Померанский/').
parent('Вартислав VII /Померанский/','Екатерина /Померанская/').
parent('Филипп фон /Брауншвейг-Грубенхаген/','Иоанн /Брауншвейг-Грубенхаген/').
parent('Филипп фон /Брауншвейг-Грубенхаген/','Хелвиза фон /Брауншвейг-Грубенхаген/').
parent('Филиппа /Армянская/','Константин /Ласкарис/').
parent('Фридрих I /Мейсенский/','Елизавета /Мейсенская/').
parent('Фридрих I /Мейсенский/','Фридрих II Серьезный /Мейсенский/').
parent('Фридрих I /Мейсенский/','Фридрих Хромой /Мейсенский/').
parent('Елизавета фон /Брауншвейг-Остероде/','Вартислав VII /Померанский/').
parent('Елизавета фон /Брауншвейг-Остероде/','Богуслав VIII /Померанский/').
parent('Елизавета фон /Брауншвейг-Остероде/','Маргарита (Малгоржата) /Померанская/').
parent('Елизавета фон /Брауншвейг-Остероде/','Барним V /Померанский/').
parent('Рикса /Шведская/','Эльжбетта (Рикса) /Польская/').
parent('Гюи де /Лузиньян/','Гуго IV де/Лузиньян/').
parent('Гюи де /Лузиньян/','Изабелла де /Лузиньян/').
parent('Елизавета /Мейсенская/','Беатриса /Гогенцоллерн-Нюрнбергская/').
parent('Елизавета /Мейсенская/','Елизавета фон /Гогенцоллерн/').
parent('Елизавета /Мейсенская/','Маргарита /Гогенцоллерн-Нюрнбергская/').
parent('Елизавета /Мейсенская/','Анна /Гогенцоллерн-Нюрнбергская/').
parent('Елизавета /Мейсенская/','Иоанн III /Гогенцоллерн-Нюрнбергский/').
parent('Елизавета /Мейсенская/','Фридрих I (VI) /Бранденбургский/').
parent('Елизавета /Мейсенская/','Екатерина /Гогенцоллерн-Нюрнбергская/').
parent('Елизавета /Мейсенская/','Агнесса /Гогенцоллерн-Нюрнбергская/').
parent('Генрих I де/Лузиньян/','Гуго II де/Лузиньян/').
parent('Адела (Алиса) /Шампанская/','Мария де /Лузиньян/').
parent('Адела (Алиса) /Шампанская/','Генрих I де/Лузиньян/').
parent('Адела (Алиса) /Шампанская/','Изабелла де /Лузиньян/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','Агнесса фон /Брауншвейг-Грубенхаген/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','София фон /Брауншвейг-Грубенхаген/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','Елизавета фон /Брауншвейг-Грубенхаген/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','Маргарита фон /Брауншвейг-Грубенхахен/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','Анна фон /Брауншвейг-Грубенхаген/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','Генрих III фон /Брауншвейг-Грубенхаген/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','Эрнст III фон /Брауншвейг-Грубенхаген/').
parent('Эрик I фон /Брауншвейг-Грубенхаген/','Альбрехт III фон /Брауншвейг-Остероде/').
parent('Алексей /Комнин/','Стефан /Комнин/').
parent('Фридрих фон /Брауншвейг-Остероде/','Оттон II фон /Брауншвейг-Остероде/').
parent('Оттон I фон /Брауншвейг-Геттинген/','Вильгельм фон /Брауншвейг-Геттинген/').
parent('Оттон I фон /Брауншвейг-Геттинген/','Оттон II Одноглазый фон /Брауншвейг-Геттинген/').
parent('Оттон I фон /Брауншвейг-Геттинген/','Анна фон /Брауншвейг-Геттинген/').
parent('Оттон I фон /Брауншвейг-Геттинген/','Елизавета фон /Брауншвейг-Геттинген/').
parent('Ульрих III /Каринтийский/','Генрих /Каринтийский/').
parent('Сибилла де /Лузиньян/','Цабель /Армянская/').
parent('Сибилла де /Лузиньян/','Филиппа /Армянская/').
parent('Анна /Мейсенская/','Схоластика /Саксонская/').
parent('Изабелла де /Лузиньян/','Гуго III де/Лузиньян/').
parent('Мария /Комнин/','Изабелла /Иерусалимская/').
parent('Гертруда /Австрийская/','Фридрих III /Австрийский/').
parent('Гертруда /Австрийская/','Агнесса /Баденская/').
parent('Агнесса /Австрийская/','Бернхард II /Каринтийский/').
parent('Агнесса /Австрийская/','Ульрих II /Каринтийский/').
parent('Гуго де /Бриенн/','Готье V де/Бриенн/').
parent('Изабелла /Иерусалимская/','Мария /Шампанская/').
parent('Изабелла /Иерусалимская/','Адела (Алиса) /Шампанская/').
parent('Изабелла /Иерусалимская/','Филиппа /Шампанская/').
parent('Изабелла /Иерусалимская/','Мария Иоланта /Монферратская/').
parent('Изабелла /Иерусалимская/','Сибилла де /Лузиньян/').
parent('Иоанн /Комнин/','Алексей /Комнин/').
parent('Иоанн /Комнин/','Мария /Комнин/').
parent('Иоанн /Комнин/','Феодора /Комнин/').
parent('Иоанн /Комнин/','N /Комнин/').
parent('Балтазар /Тюрингский/','Анна /Мейсенская/').
parent('Балтазар /Тюрингский/','Фридрих Миролюбивый /Тюрингский/').
parent('Филиппа /Шампанская/','Генрих де /Бриенн/').
parent('Филиппа /Шампанская/','Эрард де /Бриенн/').
parent('Филиппа /Шампанская/','Мария де /Бриенн/').
parent('Филиппа /Шампанская/','Изабелла де /Бриенн/').
parent('Филиппа /Шампанская/','Жанна де /Бриенн/').
parent('Елизавета /Померанская/','Иоанн II (IV)/Мекленбург-Шверинский/').
parent('Богуслав VIII /Померанский/','Ингеборга /Померанская/').
parent('Богуслав VIII /Померанский/','Богуслав IX /Померанский/').
parent('Богуслав VIII /Померанский/','Адельгейда /Померанская/').
parent('Генрих /Австрийский/','Генрих /Австрийский/').


married(H, W):-
    parent(H, C), 
    sex(H, 'M'),
    parent(W, C),
    sex(W, 'F').

sibling(X,Y):-
    parent(Z, X),
    parent(Z, Y),
    X \= Y.

brotherInLaw(B, X):-
    married(X, W),
    sex(W, 'F'),
    sibling(B, W),
    sex(B, 'M').

relationship(brother, X, Y):-
    sibling(X, Y),
    sex(X, 'M').

relationship(sister, X, Y):-
    sibling(X, Y),
    sex(X, 'F').

relationship(husband, X, Y):-
    married(X, Y),
    sex(X, 'M').

relationship(wife, X, Y):-
    married(X, Y),
    sex(X, 'F').


relationship(son, X, Y):-
    parent(Y, X),
    sex(X, 'M').

relationship(daughter, X, Y):-
    parent(Y, X),
    sex(X, 'F').

relationship(father, X, Y):-
    parent(X, Y),
    sex(X, 'M').

relationship(mother, X, Y):-
    parent(X, Y),
    sex(X, 'F').

findNext([X|T],[Y,X|T]):-
    relationship(_,X,Y),
    \+ member(Y,[X|T]).

search(X,Y,P):-
    bfs([[X]],Y,L),
    reverse(L,P).

bfs([[X|T]|_],X,[X|T]).
bfs([_|T],Y,L):-
    bfs(T,Y,L).
bfs([P|QI],X,R):-
    findall(Z,findNext(P,Z),T),
    append(QI,T,Q),
    bfs(Q,X,R).

relations([X,Y|T], R, L):-
    relationship(RS, X, Y),
    relations([Y|T], [RS|R], L).

relations([_], L,L).

relative(X, Y, L):-
    search(X, Y, P),
    relations(P, [], L).